Luke-li-Chen/STM32_BSP/STM32_BSP/User/BSP_C/usart/bsp_debug_usart.h
#ifndef __DEBUG_USART_H
#define __DEBUG_USART_H

#include "stm32f4xx.h"
#include <stdio.h>

#ifdef __cplusplus
extern "C" {
#endif

// 引脚定义
/*******************************************************/
#define DEBUG_USART                             USART1
#define DEBUG_USART_CLK                         RCC_APB2Periph_USART1

#define DEBUG_USART_RX_GPIO_PORT                GPIOA
#define DEBUG_USART_RX_GPIO_CLK                 RCC_AHB1Periph_GPIOA
#define DEBUG_USART_RX_PIN                      GPIO_Pin_10
#define DEBUG_USART_RX_AF                       GPIO_AF_USART1
#define DEBUG_USART_RX_SOURCE                   GPIO_PinSource10

#define DEBUG_USART_TX_GPIO_PORT                GPIOA
#define DEBUG_USART_TX_GPIO_CLK                 RCC_AHB1Periph_GPIOA
#define DEBUG_USART_TX_PIN                      GPIO_Pin_9
#define DEBUG_USART_TX_AF                       GPIO_AF_USART1
#define DEBUG_USART_TX_SOURCE                   GPIO_PinSource9


#define DEBUG_USART_IRQHandler                  USART1_IRQHandler
#define DEBUG_USART_IRQ                         USART1_IRQn
/************************************************************/


#define __DEBUG     //开启串口调试

#ifdef  __DEBUG
#define DEBUG(format,...)   printf("File:"__FILE__",Line:%03d:"format"\n",__LINE__,##__VA_ARGS__)
#else
#define DEBUG(format,...)
#endif


void Debug_USART_Config(int baud);
void Usart_SendByte(USART_TypeDef * pUSARTx, uint8_t ch);
void Usart_SendnStr(USART_TypeDef * pUSARTx, uint8_t *str, uint32_t strlen);
void Usart_SendStr(USART_TypeDef * pUSARTx, const uint8_t *str);
int fputc(int ch, FILE *f);
int fgetc(FILE *f);

#ifdef __cplusplus
}
#endif

#endif  /* __USART1_H */
